<template>
  <Swiper>
    <ul class="service__items">
          <li class="service__item fade-in fade-in-up">
            <h3>Webサイト制作</h3>
            <img src="./img2/website1.png" alt="" />
            <p>
              新規サイトの制作はもちろん、レスポンシブコーディングやアニメーションなど動きのあるサイト制作も可能です。
            </p>
          </li>
          <li class="service__item fade-in fade-in-up">
            <h3>Webデザイン</h3>
            <img src="./img2/design.png" alt="" />
            <p>
              クライアント様からのイメージを詳しくお聞きし、より良いデザインを作っていきます。
            </p>
          </li>
          <li class="service__item fade-in fade-in-up">
            <h3>Webサイトリニューアル</h3>
            <img src="./img2/siterenewal.png" alt="" />
            <p>現状のWebサイトの改良や修正なども可能です。</p>
          </li>
          <li class="service__item fade-in fade-in-up">
            <h3>飲食店コンサルタント</h3>
            <img src="./img2/consulting.png" alt="" />
            <p>
              飲食店、パティシエの経験を活かしコンサルタントを行っております。<br />
              ケーキ屋、カフェ、デザート屋などお気軽にご相談ください。
            </p>
          </li>
          <li class="service__item fade-in fade-in-up">
            <h3>レシピ開発</h3>
            <img src="./img2/cake.png" alt="" />
            <p>
              ２０年分のレシピや新作の考え方を活かしてレシピ１品から承ります。<br />
              栄養学も学習中で体に良いものも考案できます。
            </p>
          </li>
          <li class="service__item fade-in fade-in-up">
            <h3>写真・動画撮影</h3>
            <img src="./img2/camera.png" alt="" />
            <p>
              写真、動画撮影も承ります。<br />
              ポートフォリオの写真は自分が撮影しました。
            </p>
          </li>
        </ul>
  </Swiper>
</template>

<script setup lang="ts">
import { Swiper,SwiperSlide } from "swiper/vue";
/**===================================================================================================================
 * 
 ===================================================================================================================**/
//------------------------------------------------------------------------------------------------------------
// 引数
//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------
// 定数・変数（state）
//------------------------------------------------------------------------------------------------------------
//------------------------------------------------------------------------------------------------------------
// ライフサイクル
//------------------------------------------------------------------------------------------------------------
/*
onBeforeMount(() => {
  //記憶した位置、サイズでの復帰を可能にする
})

onMounted(() => {
  //window.addEventListener('resize', onGetPosition)
})

onBeforeUnmount(() => {
  //window.removeEventListener('resize', onGetPosition)
})
*/
//------------------------------------------------------------------------------------------------------------
//watch
//------------------------------------------------------------------------------------------------------------
/*
watch(
  () => props.value,
  (value) => {
    input.value = value
  }
)
//------------------------------------------------------------------------------------------------------------
//computed
//------------------------------------------------------------------------------------------------------------
/*
const counter: Ref<number> = useState('counter', () => 500)

// computedによりcounter変数の監視が行われる
const doubleCount = computed(() => {
  return counter.value * 2
})
*/
//------------------------------------------------------------------------------------------------------------
// エミット
//------------------------------------------------------------------------------------------------------------
/*
const emits = defineEmits<{ (e: 'update:value', item: any): void }>()
const input = ref(props.value)

function onChange(value: any) {
  input.value = value
  emits('update:value', value)
}
*/

//------------------------------------------------------------------------------------------------------------
// メソッド
//------------------------------------------------------------------------------------------------------------
</script>

<style lang="scss" scoped>
</style>